#coding:utf-8
dataArr = [
    {
        "title": "层级一",
        "node": [
           {
            "title": "层级二",
            "node": [
                 {
                    "title": "层级三",
                    "node": [
                        "树节点3",
                        "树节点3",
                        "树节点3",
                        "树节点3"
                     ]
                },
                "树节点2",
                "树节点2",
                "树节点2"
             ]
            },
            "树节点1",
            "树节点1",
            "树节点1"
         ]  
    },
        
    {
        "title": "层级一",
        "node": [
            "树节点1",
            "树节点1",
            "树节点1",
            "树节点1"
        ]
    },
        
    {
        "title": "层级一",
        "node": [
           {
            "title": "层级二",
            "node": [
                 {
                    "title": "层级三",
                    "node": [
                        "树节点3",
                        "树节点3",
                        "树节点3",
                        "树节点3"
                     ]
                },
                "树节点2",
                "树节点2",
                "树节点2"
             ]
            },
            "树节点1",
            "树节点1",
            "树节点1"
         ]  
    }
]